app/views/teachers/show.html.erb

<ul>
  <% @teacher.school_classes.each do |schoolClass| %>
---
SELECT "school_classes".* FROM "school_classes"  WHERE "school_classes"."teacher_id" = ?  [["teacher_id", 1]]