app/views/schools/show.html.erb

<ul>
  <% @school.teachers.each do |teacher| %>
---
SELECT "teachers".* FROM "teachers"  WHERE "teachers"."school_id" = ?  [["school_id", 1]]