app/controllers/homeworks_controller.rb

  def index
    @homeworks = Homework.all
---
SELECT "homeworks".* FROM "homeworks"

  def show
    @homework = Homework.find(params[:id])
---
SELECT  "homeworks".* FROM "homeworks"  WHERE "homeworks"."id" = ? LIMIT 1  [["id", 1]]