app/controllers/school_classes_controller.rb

  def index
    @schoolClasses = SchoolClass.all
---
SELECT "school_classes".* FROM "school_classes"

  def show
    @schoolClass = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes"  WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]